Revit 2026 API

# MEPSectionReynoldsNumber Property

---

The Reynolds number of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ReynoldsNumber { get; }
```
```vb
Public ReadOnly Property ReynoldsNumber As Double
	Get
```
```cpp
public:
property double ReynoldsNumber {
	double get ();
}
```
```fsharp
member ReynoldsNumber : float with get
```

#### Property Value

Double

Reynolds number is a number. The Reynolds number type is UT_Number.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace